In [1]:
import pandas as pd

In [2]:
info = {
    "Name" : ["Rahul", "Harshita", "Shree"],
    "CGPA" : [8.5, 6.5, 9.5]
}

df = pd.DataFrame(info)
print(df)
df

       Name  CGPA
0     Rahul   8.5
1  Harshita   6.5
2     Shree   9.5

       Name  CGPA
0     Rahul   8.5
1  Harshita   6.5
2     Shree   9.5

In [3]:
s = pd.Series([1, 2, 3, 4, 5])
print(s)
print(type(s))

# index
print(s[0])
print(s[2])

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>
1
3

In [4]:
s = pd.Series([23, 25, 19, 34, "abc"], index = ["Adam", "Eve", "Bob", "Charlie", "string"])
print(s)

print(s["Adam"]) #Access values using label's
print(s["Bob"])

print(s[0]) #s.iloc[0]

Adam        23
Eve         25
Bob         19
Charlie     34
string     abc
dtype: object
23
19
23

C:\Users\shree\AppData\Local\Temp\ipykernel_25704\2679890740.py:7: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(s[0]) #s.iloc[0]

In [5]:
#vectorized operations
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series([11, 12, 13, 14, 15])

print(s1 + s2)

s1[0] = 100
changed_s1 = s1.drop(0)

print(s1)
print(changed_s1)

0    12
1    14
2    16
3    18
4    20
dtype: int64
0    100
1      2
2      3
3      4
4      5
dtype: int64
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
# DataFrame

info = {
    "Name" : ["Adam", "Eve", "Bob"],
    "Age" : [23, 24, 25],
    "GPA" : [9.5, 8.6, 7.2]
}

df = pd.DataFrame(info)
print(df, type(df))

print(df.index)
print(df.columns)

   Name  Age  GPA
0  Adam   23  9.5
1   Eve   24  8.6
2   Bob   25  7.2 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)
Index(['Name', 'Age', 'GPA'], dtype='object')

In [7]:
df

   Name  Age  GPA
0  Adam   23  9.5
1   Eve   24  8.6
2   Bob   25  7.2

In [8]:
df = pd.DataFrame([["Adam", 23], ["Bob", 23], ["Eve", 23]], columns = ["Name", "Age"]) #list of lists
print(df)

   Name  Age
0  Adam   23
1   Bob   23
2   Eve   23

In [9]:
import numpy as np
np_arr = np.array([[1, 2, 3], [4, 5, 6]])

df = pd.DataFrame(np_arr, columns = ['A', 'B', 'C'])
print(df)

   A  B  C
0  1  2  3
1  4  5  6

In [10]:
# csv data --> comma separated values
'''
ID,Name,Age,Department,Salary
1,Alice,25,HR,55000
2,Bob,32,IT,72000
3,Charlie,28,Finance,48000
4,David,45,Marketing,91000
5,Eva,38,IT,65000
6,Frank,29,Finance,50000
7,Grace,41,HR,82000
8,Hannah,26,Marketing,47000
9,Ian,35,IT,75000
10,Julia,30,Finance,60000
'''

df = pd.read_csv("employee_data.csv")
print(df, type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [11]:
# json data
df = pd.read_json("employee_data.json")
print(df, type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000 <class 'pandas.core.frame.DataFrame'>

In [12]:
# Methods
df.head() #gives starting 5 rows
df.tail() #gives last 5 rows
df.tail(2) #gives last 2 rows

df.sample() #gives random row
df.sample(3) #gives random 3 row

df.info() #gives summary of data

df.shape # row x col values

df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   ID          10 non-null     int64
 1   Name        10 non-null     object
 2   Age         10 non-null     int64
 3   Department  10 non-null     object
 4   Salary      10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

             ID        Age        Salary
count  10.00000  10.000000     10.000000
mean    5.50000  32.900000  64500.000000
std     3.02765   6.674162  15182.226451
min     1.00000  25.000000  47000.000000
25%     3.25000  28.250000  51250.000000
50%     5.50000  31.000000  62500.000000
75%     7.75000  37.250000  74250.000000
max    10.00000  45.000000  91000.000000

In [13]:
df.columns #prints values of columns
df.nunique() #gives unique rows

ID            10
Name          10
Age           10
Department     4
Salary        10
dtype: int64

In [14]:
# AQI Data set

df = pd.read_csv("globalAirQuality.csv")

df
df.shape

(18000, 15)

In [15]:
df.describe()

,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
count,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000,18000.000000
mean,23.065980,37.655560,40.369131,70.152228,32.055176,6.035508,48.065100,0.800595,104.645556,21.510251,57.714351,5.283910
std,26.156536,78.600701,17.647450,24.999440,13.820680,2.454790,14.950849,0.250254,25.616070,9.509444,18.844908,2.741712
min,-37.814000,-123.121000,0.025000,0.061000,0.013000,0.003000,0.114000,0.000000,16.000000,5.000000,25.002000,0.500000
25%,12.972000,2.352000,27.904500,53.125500,22.362500,4.360750,38.028500,0.633000,87.000000,13.357750,41.320000,2.937000
50%,29.232000,42.146000,40.286500,69.961000,32.019500,6.026000,48.142000,0.800500,103.000000,21.455500,57.847000,5.297000
75%,41.008000,103.820000,52.436250,87.256500,41.364250,7.715250,58.258500,0.969000,121.000000,29.688250,74.234750,7.662000
max,60.170000,174.763000,115.683000,161.810000,90.019000,16.559000,103.016000,1.832000,231.000000,37.998000,89.997000,9.999000

In [16]:
# selecting data

# columns
df["country"]
df[["city", "aqi"]].sample(5)

                   city  aqi
15097  Ho Chi Minh City  110
12469         Melbourne  105
7726            Kolkata   81
14962  Ho Chi Minh City   77
860              London  128

In [17]:
# rows
df.loc[0]
df.loc[0:2] # start idx : ending idx (inclussive) 

df.iloc[2]
df.iloc[0:2] # start idx : ending idx (exclusive)

# cells - row, col
df.loc[0:2, ["city","aqi"]] 
df.columns

df.iloc[0:3, 1:5]
df.at[0, "pm25"]
df.iat[0, 5]
# df.iloc[0:2, ["city","aqi"]]

# pm25 = df["pm25"] #view
pm25 = df["city"].copy() #copy
pm25[0] = "Mumbai"

pm25

0          Mumbai
1        New York
2        New York
3        New York
4        New York
           ...
17995      Zurich
17996      Zurich
17997      Zurich
17998      Zurich
17999      Zurich
Name: city, Length: 18000, dtype: object

In [18]:
df

,timestamp,country,city,latitude,longitude,pm25,pm10,no2,so2,o3,co,aqi,temperature,humidity,wind_speed
0,2025-11-04 18:25:17.554219,US,New York,40.713,-74.006,50.295,108.938,27.998,6.539,52.568,1.096,108,18.504,70.168,3.725
1,2025-11-04 19:25:17.554219,US,New York,40.713,-74.006,32.083,63.043,36.120,4.021,43.536,1.075,90,5.838,80.088,8.969
2,2025-11-04 20:25:17.554219,US,New York,40.713,-74.006,42.250,82.553,26.935,9.538,23.320,0.977,84,31.833,62.783,9.650
3,2025-11-04 21:25:17.554219,US,New York,40.713,-74.006,30.403,79.951,63.536,7.609,31.369,0.230,158,23.140,89.153,8.956
4,2025-11-04 22:25:17.554219,US,New York,40.713,-74.006,21.083,66.423,38.997,6.919,45.615,1.085,97,13.632,76.499,4.017
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
17995,2025-11-19 13:25:17.554219,CH,Zurich,47.377,8.542,27.899,74.179,41.474,6.677,50.869,1.028,103,7.079,52.443,7.452
17996,2025-11-19 14:25:17.554219,CH,Zurich,47.377,8.542,2.950,47.988,42.235,2.821,35.551,0.644,105,28.734,85.678,4.496
17997,2025-11-19 15:25:17.554219,CH,Zurich,47.377,8.542,61.347,72.908,46.976,5.763,66.492,0.947,122,21.951,72.311,9.660
17998,2025-11-19 16:25:17.554219,CH,Zurich,47.377,8.542,40.722,95.152,32.957,5.524,53.193,0.868,95,24.042,31.880,2.642
17999,2025-11-19 17:25:17.554219,CH,Zurich,47.377,8.542,25.830,30.411,35.317,4.336,66.246,0.848,88,8.529,59.104,4.403

In [19]:
# Filtering of Data

df[ (df["aqi"] > 100)]
df[ (df["aqi"] > 100) & (df["temperature"] > 30)]

aqi_data = df[(df["aqi"] > 100) & (df["temperature"] > 30)][["city", "aqi"]]
aqi_data
aqi_data.iloc[0]
aqi_data.loc[6]

city    New York
aqi          155
Name: 6, dtype: object

In [20]:
# Query - copy
aqi_value = 50
df.query("aqi < 100 & temperature > 30")[["city", "aqi"]]

df.query("@aqi_value < 100 & temperature > 30")[["city", "aqi"]]

aqi_data = df.query("@aqi_value < 100 & temperature > 30")[["city", "aqi"]].copy()

In [21]:
aqi_data

           city  aqi
2      New York   84
6      New York  155
7      New York  115
14     New York  121
17     New York  127
...         ...  ...
17979    Zurich   56
17983    Zurich   84
17990    Zurich   59
17991    Zurich  104
17994    Zurich   94

[4344 rows x 2 columns]

In [22]:
# Cleaning Data - missing values

df = pd.read_csv("raw_data.csv")

df.isnull()
df.isna()
df.isnull().sum()

df.dropna(axis = 1) # columns drop
df.dropna() # rows drop

df.fillna(0)

cleaned_data = df.copy()
cleaned_data["age"] = cleaned_data["age"].fillna(cleaned_data["age"].mean())

cleaned_data

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [23]:
df.ffill()
df.bfill()

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith  34.0  Canada   Female  62000.0
3    3          Alex  34.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female  51000.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6    Ahmed Khan  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     USA     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz  31.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [24]:
# Handle Duplicates

df.duplicated()
df["country"].duplicated()
df[["country", "gender"]].duplicated()

df2 = df.copy()
df.drop_duplicates(inplace=True)

In [25]:
df

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [26]:
df2

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [27]:
# Data Types
df.dtypes
df2 = df.copy()

df2 = df2.fillna(0)
df2["age"] = df2["age"].astype("int64").copy()
df2.dtypes

id           int64
name        object
age          int64
country     object
gender      object
income     float64
dtype: object

In [28]:
df2

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith    0  Canada   Female  62000.0
3    3          Alex    0     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female      0.0
5    5        Li Wei   27   China     Male  51000.0
6    6             0   45   India   Female  73000.0
7    7    Ahmed Khan   38       0     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz    0  Mexico     Male  45000.0
10  10   Emily Davis   31     USA        0  58000.0

In [41]:
aqi_data = pd.read_csv("globalAirQuality.csv")
aqi_data["timestamp"] = pd.to_datetime(aqi_data["timestamp"])
aqi_data["timestamp"].dtype

dtype('<M8[ns]')

In [32]:
date_str = pd.Series([pd.to_datetime("2026-12-31")])
type(date_str.dtypes)

numpy.dtypes.DateTime64DType

In [50]:
df["gender"].str.lower()
df["gender"].str.upper()
df["gender"].str.capitalize()

df["name"].str.split(" ")

df["country"].str.contains("US")

df["country"].str.contains("india", case = False)

0     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object